InformationRegisters/ИсполнителиПоДенежнымСредствамСобственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиПоДенежнымСредствамСобственные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛицензииДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЛицензииДоговоровДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лицензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыБанковскихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыБанковскихСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетЭскроу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СчетаДоверительногоУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Числовая часть кода счета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализированныйДепозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиКонсолидированныйБухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсполнителиПоДенежнымСредствамСобственные/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// если расчетный счет закрыт, то исполнитель тоже должен быть закрыт
		ДатаЗакрытияСчета = Запись.РасчетныйСчет.ДатаЗакрытия;
		
		Если ЗначениеЗаполнено(ДатаЗакрытияСчета) Тогда
			Если Запись.ДатаЗакрытия > ДатаЗакрытияСчета Или Не ЗначениеЗаполнено(Запись.ДатаЗакрытия) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия исполнителя по р/счету «" + Запись.РасчетныйСчет + "» не должна быть позднее даты закрытия счета " + Формат(ДатаЗакрытияСчета, "ДФ=dd.MM.yyyy"),,,, Отказ);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	КонтрольВидаБанковскихСчетов(Отказ);
	
КонецПроцедуры // ПередЗаписью

Процедура КонтрольВидаБанковскихСчетов(Отказ)
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		Если ЭтотОбъект[0].Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
			//Проверка только для управляющих компаний
			//ДК ошибочно попадает в проверку. Технический долг #Архитектор и #Аналитик
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(Исполнители.Организация КАК Справочник.Организации) КАК Организация,
			|	ВЫРАЗИТЬ(Исполнители.РасчетныйСчет КАК Справочник.БанковскиеСчета) КАК РасчетныйСчет,
			|	ВЫРАЗИТЬ(Исполнители.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления) КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ ВТ_Исполнители
			|ИЗ
			|	&Исполнители КАК Исполнители
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ИСТИНА КАК ЛицензияУказана,
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ВидДеятельности КАК ВидДеятельности,
			|	МАКСИМУМ(ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует) КАК Действует
			|ПОМЕСТИТЬ _ВидыДеятельностиЛицензий
			|ИЗ
			|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
			|ГДЕ
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует
			|
			|СГРУППИРОВАТЬ ПО
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ВидДеятельности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_Исполнители.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВТ_Исполнители.РасчетныйСчет КАК РасчетныйСчет,
			|	ЕСТЬNULL(ВсеВидыЛицензий.ЛицензияУказана, ЛОЖЬ) КАК ЛицензияУказана,
			|	ВЫБОР
			|		КОГДА ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.РасчетныйСчет) = ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета
			|		ИНАЧЕ ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.СчетДоверительногоУправления), ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.Иное))
			|	КОНЕЦ КАК КонтрольВидБанковскогоСчета,
			|	ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|		ИЛИ ЕСТЬNULL(_ВидыДеятельностиЛицензий.Действует, ЛОЖЬ) КАК КонтрольВидУправленияДовереннымиСредствами,
			|	ВТ_Исполнители.РасчетныйСчет.ЮрФизЛицо = ВТ_Исполнители.Организация.ЮрФизЛицо КАК ВладелецСчетаУК
			|ИЗ
			|	ВТ_Исполнители КАК ВТ_Исполнители
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УправляющиеКомпании КАК УправляющиеКомпании
			|		ПО ВТ_Исполнители.Организация.ЮрФизЛицо = УправляющиеКомпании.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_ВидыДеятельностиЛицензий.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			_ВидыДеятельностиЛицензий.ЛицензияУказана КАК ЛицензияУказана
			|		ИЗ
			|			_ВидыДеятельностиЛицензий КАК _ВидыДеятельностиЛицензий) КАК ВсеВидыЛицензий
			|		ПО ВТ_Исполнители.СчетДоверительногоУправления = ВсеВидыЛицензий.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыДеятельностиЛицензий КАК _ВидыДеятельностиЛицензий
			|		ПО ВТ_Исполнители.СчетДоверительногоУправления = _ВидыДеятельностиЛицензий.СчетДоверительногоУправления
			|			И ВТ_Исполнители.РасчетныйСчет.ВидУправленияДовереннымиСредствами = _ВидыДеятельностиЛицензий.ВидДеятельности
			|ГДЕ
			|	(НЕ ВсеВидыЛицензий.ЛицензияУказана
			|			ИЛИ НЕ ВЫБОР
			|					КОГДА ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.РасчетныйСчет) = ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета
			|					ИНАЧЕ ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.СчетДоверительногоУправления), ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.Иное))
			|				КОНЕЦ
			|			ИЛИ НЕ(ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|					ИЛИ ЕСТЬNULL(_ВидыДеятельностиЛицензий.Действует, ЛОЖЬ))
			|			ИЛИ НЕ ВТ_Исполнители.РасчетныйСчет.ЮрФизЛицо = ВТ_Исполнители.Организация.ЮрФизЛицо)";
		
		Запрос.УстановитьПараметр("Исполнители", ЭтотОбъект.Выгрузить(, "Организация,РасчетныйСчет,СчетДоверительногоУправления"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.ЛицензияУказана Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета внутреннего учёта '" + Строка(Выборка.СчетДоверительногоУправления) + "' не задана лицензия, в рамках которой осуществляется управление активами",,,, Отказ);
				Продолжить;
			КонецЕсли;
			
			ТекстСообщения = "";
			Если НЕ Выборка.ВладелецСчетаУК Тогда
				ТекстСообщения = " текущая организация не является владельцем счета";
			ИначеЕсли НЕ Выборка.КонтрольВидБанковскогоСчета И НЕ Выборка.КонтрольВидУправленияДовереннымиСредствами Тогда
				ТекстСообщения = " неверно указан 'Вид банковского счета' и поле 'Управление средствами' не соответствует условиям договора доверительного управления";
			ИначеЕсли НЕ Выборка.КонтрольВидБанковскогоСчета Тогда
				ТекстСообщения = " неверно указан 'Вид банковского счета'";
			Иначе
				ТекстСообщения = " поле 'Управление средствами' не соответствует условиям договора доверительного управления";
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В расчётном счёте " + Выборка.РасчетныйСчет + ТекстСообщения,,,, Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
